# Создание словаря с информацией о книгах
books = {
    1: {"title": "Война и мир", "author": "Лев Толстой", "year": 1869},
    2: {"title": "Остров Проклятых", "author": "Деннис Лихэйн", "year": 2014},
    3: {"title": "Гарри Поттер и Орден Феникса", "author": "Дж. К. Роулинг", "year": 2003},
    4: {"title": "Властелин колец", "author": "Дж. Р. Р. Толкин", "year": 1954},
    5: {"title": "Чарли и шоколадная фабрика", "author": "Роальд Даль", "year": 1964}
}

# Цикл для вывода информации о каждой книге
for book_id, book_info in books.items():
    print(f"---------------------- Книга {book_id} ----------------------")
    print(f" Название: {book_info['title']} , Автор: {book_info['author']},")
    print(f" ------------------------- {book_info['year']} -------------------------")
